In [2]:
import pandas as pd

Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [75]:
data = pd.read_csv(r'C:\Python\12. 20_04\ml-25m\ratings.csv')
data2 = pd.read_csv(r'C:\Python\12. 20_04\ml-25m\movies.csv')

In [87]:
film = data.merge(data2)
film

,userId,movieId,rating,timestamp,title,genres
0,1,296,5.0,1147880044,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
1,3,296,5.0,1439474476,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
2,4,296,4.0,1573938898,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
3,5,296,4.0,830786155,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
4,7,296,4.0,835444730,Pulp Fiction (1994),Comedy|Crime|Drama|Thriller
...,...,...,...,...,...,...
25000090,162358,200192,2.0,1553453039,Den frusna leoparden (1986),(no genres listed)
25000091,162358,200194,2.0,1553453843,Tough Luck (2004),Action|Adventure|Thriller
25000092,162386,139970,3.5,1549215965,I Don't Speak English (1995),Comedy
25000093,162386,200726,4.0,1554651417,The Graduates (1995),Children|Drama
25000094,162386,200728,4.0,1554651472,Il pesce innamorato (1999),(no genres listed)

In [88]:
film[film.rating == 5]['title'].value_counts().sort_values(ascending=False).head(1)

Shawshank Redemption, The (1994)    39553
Name: title, dtype: int64

Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [91]:
data3 = pd.read_csv(r'C:\Python\12. 20_04\power.csv')
data3.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [92]:
data3[ data3['country'].str.contains('lat', case = False)]['country'].unique()

array(['Latvia'], dtype=object)

In [93]:
data3[ data3['country'].str.contains('lit', case = False)]['country'].unique()

array(['Lithuania'], dtype=object)

In [94]:
data3[ data3['country'].str.contains('sto', case = False)]['country'].unique()

array(['Estonia'], dtype=object)

In [104]:
filtered_countries = data3[((data3['country']=='Latvia') | (data3['country']=='Lithuania') | (data3['country']=='Estonia')) & 
                           ((data3['year']==2010) | (data3['year']==2011)| (data3['year']==2012)| 
                            (data3['year']==2013)| (data3['year']==2014)) & (data3['quantity'] > 0)]
filtered_countries

           country  year  quantity  category
373      Lithuania  2014      39.0         1
374      Lithuania  2013     192.0         1
375      Lithuania  2012     196.0         1
376      Lithuania  2011     171.0         1
377      Lithuania  2010     158.0         1
...            ...   ...       ...       ...
1188851  Lithuania  2014     639.0        71
1188852  Lithuania  2013     603.0        71
1188853  Lithuania  2012     540.0        71
1188854  Lithuania  2011     475.0        71
1188855  Lithuania  2010     224.0        71

[6275 rows x 4 columns]

In [108]:
filtered_countries.to_excel('result_set.xlsx')

Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [117]:
df = pd.read_html('https://www.moex.com/')[3]
df

   Май
    Пн   Вт    Ср    Чт  Пт  Сб  Вс
0  NaN  NaN   NaN   NaN   1   2   3
1   4*   5*   6.0   7.0   8   9  10
2   11   12  13.0  14.0  15  16  17
3   18   19  20.0  21.0  22  23  24
4   25   26  27.0  28.0  29  30  31

In [124]:
page_url = pd.read_html('https://www.moex.com/ru/markets/currency/')
page_url[0]

  Средневзв. оценка USDRUB_TOM на 11:30
0                          (24.10.2016)